{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "conv2d_193_input",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_18",
      "top" : "transpose_18",
      "type" : "transpose",
      "name" : "transpose_18"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential_35\/conv2d_193\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential_35\/conv2d_193\/Relu",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "sequential_35\/conv2d_193\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "transpose_18",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential_35\/conv2d_194\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential_35\/conv2d_194\/Relu",
      "blob_weights" : 7,
      "K" : 16,
      "blob_biases" : 5,
      "name" : "sequential_35\/conv2d_194\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "sequential_35\/conv2d_193\/Relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pool_0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_0",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "sequential_35\/conv2d_194\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential_35\/batch_normalization_66\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential_35\/activation_66\/Relu",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "sequential_35\/batch_normalization_66\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "max_pool_0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pool_1",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_1",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "sequential_35\/activation_66\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sequential_35\/conv2d_196\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential_35\/conv2d_196\/BiasAdd",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "name" : "sequential_35\/conv2d_196\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "max_pool_1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential_35\/batch_normalization_67\/FusedBatchNormV3_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential_35\/activation_67\/Relu",
      "blob_weights" : 19,
      "K" : 128,
      "blob_biases" : 17,
      "name" : "sequential_35\/batch_normalization_67\/FusedBatchNormV3_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "sequential_35\/conv2d_196\/BiasAdd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pool_2",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_2",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "sequential_35\/activation_67\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "max_pool_2",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_17",
      "top" : "transpose_17",
      "type" : "transpose",
      "name" : "transpose_17"
    },
    {
      "name" : "sequential_35\/flatten_35\/Reshape",
      "weights" : {

      },
      "dst_w" : 5408,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : -1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "transpose_17",
      "debug_info" : "sequential_35\/flatten_35\/Reshape",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "sequential_35\/flatten_35\/Reshape"
    },
    {
      "nB" : 5408,
      "top" : "sequential_35\/dense_70\/Relu",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 32,
      "blob_weights" : 23,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "sequential_35\/flatten_35\/Reshape",
      "blob_biases" : 21,
      "has_tanh" : 0,
      "debug_info" : "sequential_35\/dense_70\/BiasAdd",
      "name" : "sequential_35\/dense_70\/BiasAdd",
      "has_prelu" : 0
    },
    {
      "nB" : 32,
      "top" : "sequential_35\/dense_71\/BiasAdd",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 27,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "sequential_35\/dense_70\/Relu",
      "blob_biases" : 25,
      "has_tanh" : 0,
      "debug_info" : "sequential_35\/dense_71\/BiasAdd",
      "name" : "sequential_35\/dense_71\/BiasAdd",
      "has_prelu" : 0
    },
    {
      "bottom" : "sequential_35\/dense_71\/BiasAdd",
      "weights" : {

      },
      "nd_axis" : -1,
      "debug_info" : "sequential_35\/dense_71\/Softmax",
      "top" : "Identity",
      "type" : "softmax_nd",
      "name" : "sequential_35\/dense_71\/Softmax",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}